read_verilog -lib ../../techmap/cells_sim.v
read_verilog -lib ../../techmap/cells_map.v
read_verilog -lib ../../techmap/cells_formal.v
# read_verilog ../../techmap/cells_remove.v
read_blif top.eblif
show -prefix gold-pre-tech -format svg
prep -flatten -top top
opt_clean -purge
techmap -map +/xilinx/lut_map.v -D LUT_WIDTH=6
splitnets -ports;;
opt_clean -purge
opt_lut_ins -tech xilinx
techmap -map ../../techmap/lut1_simplif.v
opt_clean -purge
opt -full
show -prefix gold -format svg
write_verilog -norename gold.v
design -stash gold
read_verilog -lib ../../techmap/cells_sim.v
read_verilog -lib ../../techmap/cells_formal.v
read_verilog ../../techmap/iobs.v
read_verilog -lib ../../techmap/cells_map.v
read_verilog ../../techmap/cells_remove.v
read_verilog top_bit.v
prep -flatten -top top
splitnets -ports;;
opt_clean -purge
rename -hide w:*
show -prefix gate-pre-tech -format svg
techmap -map ../../techmap/lut_simplif.v
prep -flatten -top top
opt_clean -purge
opt -full
opt_lut_ins -tech xilinx
techmap -map ../../techmap/lut1_simplif.v
opt_clean -purge
opt -full
rename -hide w:*
show -prefix gate -format svg
write_verilog gate.v
design -stash gate
# design -copy-from gold -as gold top
# design -copy-from gate -as gate top
# equiv_make gold gate equiv
# prep -flatten -top equiv

# opt_clean -purge

## method 1
# opt -full
# equiv_simple -seq 5
# equiv_induct -seq 5
# equiv_status -assert

## method 2
#equiv_struct -icells t:$adff t:$equiv
#equiv_simple -seq 5
#equiv_induct -seq 5
#equiv_status -assert

## method 3
#techmap -map +/adff2dff.v
#equiv_simple -seq 5
#equiv_induct -seq 5
#equiv_status -assert

## method 4
#clk2fflogic
#equiv_simple -seq 10
#equiv_induct -seq 10
#equiv_status -assert
